
## Plan Result (prod)




<pre><code>Plan: 2 to add, 7 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.bootstrap_secrets[&#34;admin-frontend-client-secret&#34;]
  * azurerm_key_vault_secret.bootstrap_secrets[&#34;public-frontend-client-secret&#34;]
* Update
  * azurerm_key_vault_secret.api_app_reg_id
  * azurerm_key_vault_secret.bootstrap_secrets[&#34;cath-api-url&#34;]
  * azurerm_key_vault_secret.bootstrap_secrets[&#34;os-key&#34;]
  * azurerm_key_vault_secret.bootstrap_secrets[&#34;slack-channel-id&#34;]
  * azurerm_key_vault_secret.bootstrap_secrets[&#34;slack-token&#34;]
  * azurerm_key_vault_secret.public_frontend_app_reg_id
  * azurerm_key_vault_secret.session_secret


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.api_app_reg_id will be updated in-place
  ~ resource "azurerm_key_vault_secret" "api_app_reg_id" {
      ~ expiration_date         = "2028-03-05T11:52:49Z" -> (known after apply)
        id                      = "https://fact-kv-prod.vault.azure.net/secrets/api-app-reg-id/b9ec67af27f24c908dbb6ecb7b6abfc5"
        name                    = "api-app-reg-id"
        tags                    = {
            "application"         = "find-a-court-or-tribunal"
            "builtFrom"           = "https://github.com/HMCTS/fact-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "production"
            "managedBy"           = "Find a Court or Tribunal"
            "source"              = "calculated from fact-data-api-prod app reg"
        }
        # (10 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.bootstrap_secrets["admin-frontend-client-secret"] will be created
  + resource "azurerm_key_vault_secret" "bootstrap_secrets" {
      + content_type            = "Manual Secret"
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/fact-prod/providers/Microsoft.KeyVault/vaults/fact-kv-prod"
      + name                    = "bstrap-admin-frontend-client-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "find-a-court-or-tribunal"
          + "builtFrom"           = "https://github.com/HMCTS/fact-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#fact-tech"
          + "environment"         = "production"
          + "managedBy"           = "Find a Court or Tribunal"
          + "source"              = "bootstrap fact-bstrap-prod-kv secrets"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.bootstrap_secrets["cath-api-url"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "bootstrap_secrets" {
      ~ expiration_date         = "2028-03-05T11:52:49Z" -> (known after apply)
        id                      = "https://fact-kv-prod.vault.azure.net/secrets/bstrap-cath-api-url/b54734acea8e4ba5a2206f488b9bacb0"
        name                    = "bstrap-cath-api-url"
        tags                    = {
            "application"         = "find-a-court-or-tribunal"
            "builtFrom"           = "https://github.com/HMCTS/fact-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "production"
            "managedBy"           = "Find a Court or Tribunal"
            "source"              = "bootstrap fact-bstrap-prod-kv secrets"
        }
        # (10 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.bootstrap_secrets["os-key"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "bootstrap_secrets" {
      ~ expiration_date         = "2028-03-05T11:52:49Z" -> (known after apply)
        id                      = "https://fact-kv-prod.vault.azure.net/secrets/bstrap-os-key/0a08ea6a07e0409e9f0265e6094db3e8"
        name                    = "bstrap-os-key"
        tags                    = {
            "application"         = "find-a-court-or-tribunal"
            "builtFrom"           = "https://github.com/HMCTS/fact-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "production"
            "managedBy"           = "Find a Court or Tribunal"
            "source"              = "bootstrap fact-bstrap-prod-kv secrets"
        }
        # (10 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.bootstrap_secrets["public-frontend-client-secret"] will be created
  + resource "azurerm_key_vault_secret" "bootstrap_secrets" {
      + content_type            = "Manual Secret"
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/fact-prod/providers/Microsoft.KeyVault/vaults/fact-kv-prod"
      + name                    = "bstrap-public-frontend-client-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "find-a-court-or-tribunal"
          + "builtFrom"           = "https://github.com/HMCTS/fact-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#fact-tech"
          + "environment"         = "production"
          + "managedBy"           = "Find a Court or Tribunal"
          + "source"              = "bootstrap fact-bstrap-prod-kv secrets"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.bootstrap_secrets["slack-channel-id"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "bootstrap_secrets" {
      ~ expiration_date         = "2028-03-05T11:52:49Z" -> (known after apply)
        id                      = "https://fact-kv-prod.vault.azure.net/secrets/bstrap-slack-channel-id/47c60c30902046e69423df1b9df9d138"
        name                    = "bstrap-slack-channel-id"
        tags                    = {
            "application"         = "find-a-court-or-tribunal"
            "builtFrom"           = "https://github.com/HMCTS/fact-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "production"
            "managedBy"           = "Find a Court or Tribunal"
            "source"              = "bootstrap fact-bstrap-prod-kv secrets"
        }
        # (10 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.bootstrap_secrets["slack-token"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "bootstrap_secrets" {
      ~ expiration_date         = "2028-03-05T11:52:49Z" -> (known after apply)
        id                      = "https://fact-kv-prod.vault.azure.net/secrets/bstrap-slack-token/ff9e013177624a91988e7c9cdd4959fd"
        name                    = "bstrap-slack-token"
        tags                    = {
            "application"         = "find-a-court-or-tribunal"
            "builtFrom"           = "https://github.com/HMCTS/fact-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "production"
            "managedBy"           = "Find a Court or Tribunal"
            "source"              = "bootstrap fact-bstrap-prod-kv secrets"
        }
        # (10 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.public_frontend_app_reg_id will be updated in-place
  ~ resource "azurerm_key_vault_secret" "public_frontend_app_reg_id" {
      ~ expiration_date         = "2028-03-05T11:52:49Z" -> (known after apply)
        id                      = "https://fact-kv-prod.vault.azure.net/secrets/public-frontend-app-reg-id/0bc0bc90a53c4680b7099ae5464b9585"
        name                    = "public-frontend-app-reg-id"
        tags                    = {
            "application"         = "find-a-court-or-tribunal"
            "builtFrom"           = "https://github.com/HMCTS/fact-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "production"
            "managedBy"           = "Find a Court or Tribunal"
            "source"              = "calculated from fact-frontend-prod app reg"
        }
        # (10 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.session_secret will be updated in-place
  ~ resource "azurerm_key_vault_secret" "session_secret" {
      ~ expiration_date         = "2028-03-05T11:52:49Z" -> (known after apply)
        id                      = "https://fact-kv-prod.vault.azure.net/secrets/session-secret/1ff183f8957a40c8be4785b0472ada3d"
        name                    = "session-secret"
        tags                    = {
            "application"         = "find-a-court-or-tribunal"
            "builtFrom"           = "https://github.com/HMCTS/fact-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "production"
            "managedBy"           = "Find a Court or Tribunal"
        }
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 7 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":104,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->